*** src/app.rs:105:9: replace App::execute_kill with ()

*** mutation diff:
--- src/app.rs
+++ replace App::execute_kill with ()
@@ -97,28 +97,17 @@
                     pid: port.pid,
                     name: port.process_name.clone(),
                 };
             }
         }
     }
 
     pub fn execute_kill(&mut self) {
-        if let Mode::ConfirmKill { pid, .. } = self.mode {
-            match kill_process(pid) {
-                Ok(_) => {
-                    self.message = Some(format!("Killed process {}", pid));
-                    let _ = self.refresh_ports();
-                }
-                Err(e) => {
-                    self.message = Some(format_error(&e));
-                }
-            }
-        }
-        self.mode = Mode::Normal;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn cancel_modal(&mut self) {
         self.mode = Mode::Normal;
     }
 }
 
 #[cfg(test)]

---- events::tests::test_confirm_mode_yes stdout ----

thread 'events::tests::test_confirm_mode_yes' (891215) panicked at src/events.rs:187:2:
assertion failed: matches!(app.mode, crate::app::Mode::Normal)

failures:
    events::tests::test_confirm_mode_yes

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
