*** src/app.rs:120:9: replace App::cancel_modal with ()

*** mutation diff:
--- src/app.rs
+++ replace App::cancel_modal with ()
@@ -112,17 +112,17 @@
                     self.message = Some(format_error(&e));
                 }
             }
         }
         self.mode = Mode::Normal;
     }
 
     pub fn cancel_modal(&mut self) {
-        self.mode = Mode::Normal;
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     fn create_test_port(port: u16, pid: u32, name: &str) -> PortInfo {

---- app::tests::test_mode_transitions stdout ----

thread 'app::tests::test_mode_transitions' (891651) panicked at src/app.rs:205:2:
assertion failed: matches!(app.mode, Mode::Normal)

---- events::tests::test_confirm_mode_no stdout ----

thread 'events::tests::test_confirm_mode_no' (891654) panicked at src/events.rs:203:9:
assertion failed: matches!(app.mode, crate::app::Mode::Normal)

failures:
    app::tests::test_mode_transitions
    events::tests::test_confirm_mode_no

test result: FAILED. 13 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
