*** src/app.rs:37:2: replace App::refresh_ports -> Result<(), Box<dyn std::error::Error>> with Ok(())

*** mutation diff:
--- src/app.rs
+++ replace App::refresh_ports -> Result<(), Box<dyn std::error::Error>> with Ok(())
@@ -29,24 +29,17 @@
  message: None,
  should_quit: false,
  };
  let _ = app.refresh_ports();
  app
  }
 
  pub fn refresh_ports(&mut self) -> Result<(), Box<dyn std::error::Error>> {
- match get_open_ports() {
- Ok(all_ports) => {
- self.ports = all_ports;
- self.apply_filter();
- Ok(())
- }
- Err(e) => Err(Box::new(e)),
- }
+ Ok(()) /* ~ changed by cargo-mutants ~ */
  }
 
     fn apply_filter(&mut self) {
         self.filtered = if self.search_query.is_empty() {
             (0..self.ports.len()).collect()
         } else {
             let query = self.search_query.to_lowercase();
             self.ports

*** result: Success
