*** src/app.rs:48:9: replace App::apply_filter with ()

*** mutation diff:
--- src/app.rs
+++ replace App::apply_filter with ()
@@ -40,32 +40,17 @@
  self.apply_filter();
  Ok(())
  }
  Err(e) => Err(Box::new(e)),
  }
  }
 
     fn apply_filter(&mut self) {
-        self.filtered = if self.search_query.is_empty() {
-            (0..self.ports.len()).collect()
-        } else {
-            let query = self.search_query.to_lowercase();
-            self.ports
-                .iter()
-                .enumerate()
-                .filter(|(_, p)| {
-                    p.port.to_string().contains(&query)
-                        || p.process_name.to_lowercase().contains(&query)
-                        || p.process_path.to_lowercase().contains(&query)
-                })
-                .map(|(i, _)| i)
-                .collect()
-        };
-        self.selected = self.selected.min(self.filtered.len().saturating_sub(1));
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn update_search(&mut self, query: String) {
         self.search_query = query;
         self.apply_filter();
     }
 
     pub fn next(&mut self) {

---- app::tests::test_search_filter stdout ----

thread 'app::tests::test_search_filter' (935761) panicked at src/app.rs:163:9:
assertion `left == right` failed
  left: 3
 right: 2

failures:
    app::tests::test_search_filter

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
