*** src/app.rs:57:25: replace || with && in App::apply_filter

*** mutation diff:
--- src/app.rs
+++ replace || with && in App::apply_filter
@@ -49,17 +49,17 @@
             (0..self.ports.len()).collect()
         } else {
             let query = self.search_query.to_lowercase();
             self.ports
                 .iter()
                 .enumerate()
                 .filter(|(_, p)| {
                     p.port.to_string().contains(&query)
-                        || p.process_name.to_lowercase().contains(&query)
+                        && /* ~ changed by cargo-mutants ~ */ p.process_name.to_lowercase().contains(&query)
                         || p.process_path.to_lowercase().contains(&query)
                 })
                 .map(|(i, _)| i)
                 .collect()
         };
         self.selected = self.selected.min(self.filtered.len().saturating_sub(1));
     }

---- app::tests::test_search_filter stdout ----

thread 'app::tests::test_search_filter' (936644) panicked at src/app.rs:178:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    app::tests::test_search_filter

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
