*** src/app.rs:67:9: replace App::update_search with ()

*** mutation diff:
--- src/app.rs
+++ replace App::update_search with ()
@@ -59,18 +59,17 @@
                 })
                 .map(|(i, _)| i)
                 .collect()
         };
         self.selected = self.selected.min(self.filtered.len().saturating_sub(1));
     }
 
     pub fn update_search(&mut self, query: String) {
-        self.search_query = query;
-        self.apply_filter();
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn next(&mut self) {
         if !self.filtered.is_empty() && self.selected < self.filtered.len() - 1 {
             self.selected += 1;
         }
     }

---- events::tests::test_search_typing stdout ----

thread 'events::tests::test_search_typing' (937073) panicked at src/events.rs:169:2:
assertion `left == right` failed
  left: ""
 right: "test"

---- app::tests::test_search_filter stdout ----

thread 'app::tests::test_search_filter' (937066) panicked at src/app.rs:177:9:
assertion `left == right` failed
  left: 3
 right: 2

failures:
    app::tests::test_search_filter
    events::tests::test_search_typing

test result: FAILED. 13 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
