*** src/app.rs:72:55: replace < with > in App::next

*** mutation diff:
--- src/app.rs
+++ replace < with > in App::next
@@ -64,17 +64,17 @@
     }
 
     pub fn update_search(&mut self, query: String) {
         self.search_query = query;
         self.apply_filter();
     }
 
     pub fn next(&mut self) {
-        if !self.filtered.is_empty() && self.selected < self.filtered.len() - 1 {
+        if !self.filtered.is_empty() && self.selected > /* ~ changed by cargo-mutants ~ */ self.filtered.len() - 1 {
             self.selected += 1;
         }
     }
 
     pub fn previous(&mut self) {
         if self.selected > 0 {
             self.selected -= 1;
         }

---- app::tests::test_navigation stdout ----

thread 'app::tests::test_navigation' (939178) panicked at src/app.rs:149:9:
assertion `left == right` failed
  left: 0
 right: 1

---- events::tests::test_navigation stdout ----

thread 'events::tests::test_navigation' (939182) panicked at src/events.rs:132:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    app::tests::test_navigation
    events::tests::test_navigation

test result: FAILED. 13 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
