*** src/app.rs:72:9: replace App::next with ()

*** mutation diff:
--- src/app.rs
+++ replace App::next with ()
@@ -64,19 +64,17 @@
     }
 
     pub fn update_search(&mut self, query: String) {
         self.search_query = query;
         self.apply_filter();
     }
 
     pub fn next(&mut self) {
-        if !self.filtered.is_empty() && self.selected < self.filtered.len() - 1 {
-            self.selected += 1;
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn previous(&mut self) {
         if self.selected > 0 {
             self.selected -= 1;
         }
     }

---- app::tests::test_navigation stdout ----

thread 'app::tests::test_navigation' (937487) panicked at src/app.rs:147:9:
assertion `left == right` failed
  left: 0
 right: 1

---- events::tests::test_navigation stdout ----

thread 'events::tests::test_navigation' (937491) panicked at src/events.rs:132:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    app::tests::test_navigation
    events::tests::test_navigation

test result: FAILED. 13 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
