*** src/app.rs:73:27: replace += with -= in App::next

*** mutation diff:
--- src/app.rs
+++ replace += with -= in App::next
@@ -65,17 +65,17 @@
 
     pub fn update_search(&mut self, query: String) {
         self.search_query = query;
         self.apply_filter();
     }
 
     pub fn next(&mut self) {
         if !self.filtered.is_empty() && self.selected < self.filtered.len() - 1 {
-            self.selected += 1;
+            self.selected -= /* ~ changed by cargo-mutants ~ */ 1;
         }
     }
 
     pub fn previous(&mut self) {
         if self.selected > 0 {
             self.selected -= 1;
         }
     }

---- app::tests::test_navigation stdout ----

thread 'app::tests::test_navigation' (886508) panicked at src/app.rs:73:13:
attempt to subtract with overflow

---- events::tests::test_navigation stdout ----

thread 'events::tests::test_navigation' (886512) panicked at src/app.rs:73:13:
attempt to subtract with overflow

failures:
    app::tests::test_navigation
    events::tests::test_navigation

test result: FAILED. 13 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
