*** src/app.rs:78:26: replace > with == in App::previous

*** mutation diff:
--- src/app.rs
+++ replace > with == in App::previous
@@ -70,17 +70,17 @@
 
     pub fn next(&mut self) {
         if !self.filtered.is_empty() && self.selected < self.filtered.len() - 1 {
             self.selected += 1;
         }
     }
 
     pub fn previous(&mut self) {
-        if self.selected > 0 {
+        if self.selected == /* ~ changed by cargo-mutants ~ */ 0 {
             self.selected -= 1;
         }
     }
 
     pub fn enter_search_mode(&mut self) {
         self.mode = Mode::Search;
         self.search_query.clear();
         self.apply_filter();

---- events::tests::test_navigation stdout ----

thread 'events::tests::test_navigation' (942213) panicked at src/events.rs:138:9:
assertion `left == right` failed
  left: 2
 right: 1

---- app::tests::test_navigation stdout ----

thread 'app::tests::test_navigation' (942209) panicked at src/app.rs:158:9:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    app::tests::test_navigation
    events::tests::test_navigation

test result: FAILED. 13 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
