*** src/app.rs:78:26: replace > with >= in App::previous

*** mutation diff:
--- src/app.rs
+++ replace > with >= in App::previous
@@ -70,17 +70,17 @@
 
     pub fn next(&mut self) {
         if !self.filtered.is_empty() && self.selected < self.filtered.len() - 1 {
             self.selected += 1;
         }
     }
 
     pub fn previous(&mut self) {
-        if self.selected > 0 {
+        if self.selected >= /* ~ changed by cargo-mutants ~ */ 0 {
             self.selected -= 1;
         }
     }
 
     pub fn enter_search_mode(&mut self) {
         self.mode = Mode::Search;
         self.search_query.clear();
         self.apply_filter();

---- app::tests::test_navigation stdout ----

thread 'app::tests::test_navigation' (943053) panicked at src/app.rs:79:13:
attempt to subtract with overflow

failures:
    app::tests::test_navigation

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
