*** src/app.rs:78:9: replace App::previous with ()

*** mutation diff:
--- src/app.rs
+++ replace App::previous with ()
@@ -70,19 +70,17 @@
 
     pub fn next(&mut self) {
         if !self.filtered.is_empty() && self.selected < self.filtered.len() - 1 {
             self.selected += 1;
         }
     }
 
     pub fn previous(&mut self) {
-        if self.selected > 0 {
-            self.selected -= 1;
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn enter_search_mode(&mut self) {
         self.mode = Mode::Search;
         self.search_query.clear();
         self.apply_filter();
     }

---- events::tests::test_navigation stdout ----

thread 'events::tests::test_navigation' (887356) panicked at src/events.rs:138:9:
assertion `left == right` failed
  left: 2
 right: 1

---- app::tests::test_navigation stdout ----

thread 'app::tests::test_navigation' (887352) panicked at src/app.rs:156:9:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    app::tests::test_navigation
    events::tests::test_navigation

test result: FAILED. 13 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
