*** src/app.rs:79:27: replace -= with += in App::previous

*** mutation diff:
--- src/app.rs
+++ replace -= with += in App::previous
@@ -71,17 +71,17 @@
     pub fn next(&mut self) {
         if !self.filtered.is_empty() && self.selected < self.filtered.len() - 1 {
             self.selected += 1;
         }
     }
 
     pub fn previous(&mut self) {
         if self.selected > 0 {
-            self.selected -= 1;
+            self.selected += /* ~ changed by cargo-mutants ~ */ 1;
         }
     }
 
     pub fn enter_search_mode(&mut self) {
         self.mode = Mode::Search;
         self.search_query.clear();
         self.apply_filter();
     }

---- events::tests::test_navigation stdout ----

thread 'events::tests::test_navigation' (889066) panicked at src/events.rs:138:9:
assertion `left == right` failed
  left: 3
 right: 1

---- app::tests::test_navigation stdout ----

thread 'app::tests::test_navigation' (889062) panicked at src/app.rs:158:9:
assertion `left == right` failed
  left: 3
 right: 1

failures:
    app::tests::test_navigation
    events::tests::test_navigation

test result: FAILED. 13 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
