*** src/app.rs:84:9: replace App::enter_search_mode with ()

*** mutation diff:
--- src/app.rs
+++ replace App::enter_search_mode with ()
@@ -76,19 +76,17 @@
 
     pub fn previous(&mut self) {
         if self.selected > 0 {
             self.selected -= 1;
         }
     }
 
     pub fn enter_search_mode(&mut self) {
-        self.mode = Mode::Search;
-        self.search_query.clear();
-        self.apply_filter();
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn exit_search_mode(&mut self) {
         self.mode = Mode::Normal;
     }
 
     pub fn confirm_kill(&mut self) {
         if let Some(&idx) = self.filtered.get(self.selected) {

---- events::tests::test_search_mode_activation stdout ----

thread 'events::tests::test_search_mode_activation' (944364) panicked at src/events.rs:148:2:
assertion failed: matches!(app.mode, crate::app::Mode::Search)

---- app::tests::test_mode_transitions stdout ----

thread 'app::tests::test_mode_transitions' (944357) panicked at src/app.rs:192:9:
assertion failed: matches!(app.mode, Mode::Search)

failures:
    app::tests::test_mode_transitions
    events::tests::test_search_mode_activation

test result: FAILED. 13 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
