*** src/app.rs:90:9: replace App::exit_search_mode with ()

*** mutation diff:
--- src/app.rs
+++ replace App::exit_search_mode with ()
@@ -82,17 +82,17 @@
 
     pub fn enter_search_mode(&mut self) {
         self.mode = Mode::Search;
         self.search_query.clear();
         self.apply_filter();
     }
 
     pub fn exit_search_mode(&mut self) {
-        self.mode = Mode::Normal;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn confirm_kill(&mut self) {
         if let Some(&idx) = self.filtered.get(self.selected) {
             if let Some(port) = self.ports.get(idx) {
                 self.mode = Mode::ConfirmKill {
                     pid: port.pid,
                     name: port.process_name.clone(),

---- events::tests::test_search_mode_exit stdout ----

thread 'events::tests::test_search_mode_exit' (890374) panicked at src/events.rs:156:2:
assertion failed: matches!(app.mode, crate::app::Mode::Normal)

---- app::tests::test_mode_transitions stdout ----

thread 'app::tests::test_mode_transitions' (890366) panicked at src/app.rs:197:9:
assertion failed: matches!(app.mode, Mode::Normal)

failures:
    app::tests::test_mode_transitions
    events::tests::test_search_mode_exit

test result: FAILED. 13 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
