*** src/app.rs:94:9: replace App::confirm_kill with ()

*** mutation diff:
--- src/app.rs
+++ replace App::confirm_kill with ()
@@ -86,24 +86,17 @@
         self.apply_filter();
     }
 
     pub fn exit_search_mode(&mut self) {
         self.mode = Mode::Normal;
     }
 
     pub fn confirm_kill(&mut self) {
-        if let Some(&idx) = self.filtered.get(self.selected) {
-            if let Some(port) = self.ports.get(idx) {
-                self.mode = Mode::ConfirmKill {
-                    pid: port.pid,
-                    name: port.process_name.clone(),
-                };
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn execute_kill(&mut self) {
         if let Mode::ConfirmKill { pid, .. } = self.mode {
             match kill_process(pid) {
                 Ok(_) => {
                     self.message = Some(format!("Killed process {}", pid));
                     let _ = self.refresh_ports();

---- app::tests::test_mode_transitions stdout ----

thread 'app::tests::test_mode_transitions' (890789) panicked at src/app.rs:195:9:
assertion failed: matches!(app.mode, Mode::ConfirmKill { pid: 100, .. })

---- events::tests::test_confirm_mode_yes stdout ----

thread 'events::tests::test_confirm_mode_yes' (890793) panicked at src/events.rs:184:2:
assertion failed: matches!(app.mode, crate::app::Mode::ConfirmKill { .. })

failures:
    app::tests::test_mode_transitions
    events::tests::test_confirm_mode_yes

test result: FAILED. 13 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
