*** src/events.rs:18:5: replace handle_key_event -> bool with true

*** mutation diff:
--- src/events.rs
+++ replace handle_key_event -> bool with true
@@ -10,21 +10,17 @@
                 return Ok(handle_key_event(app, key));
             }
         }
     }
     Ok(false)
 }
 
 fn handle_key_event(app: &mut App, key: KeyEvent) -> bool {
-    match &app.mode {
-        Mode::Normal => handle_normal_mode(app, key),
-        Mode::Search => handle_search_mode(app, key),
-        Mode::ConfirmKill { .. } => handle_confirm_mode(app, key),
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn handle_normal_mode(app: &mut App, key: KeyEvent) -> bool {
     match key.code {
         KeyCode::Char('q') | KeyCode::Char('Q') => {
             app.should_quit = true;
             true
         }

*** result: Success
