*** src/events.rs:26:5: replace handle_normal_mode -> bool with false

*** mutation diff:
--- src/events.rs
+++ replace handle_normal_mode -> bool with false
@@ -18,50 +18,17 @@
     match &app.mode {
         Mode::Normal => handle_normal_mode(app, key),
         Mode::Search => handle_search_mode(app, key),
         Mode::ConfirmKill { .. } => handle_confirm_mode(app, key),
     }
 }
 
 fn handle_normal_mode(app: &mut App, key: KeyEvent) -> bool {
-    match key.code {
-        KeyCode::Char('q') | KeyCode::Char('Q') => {
-            app.should_quit = true;
-            true
-        }
-        KeyCode::Char('c') if key.modifiers.contains(KeyModifiers::CONTROL) => {
-            app.should_quit = true;
-            true
-        }
-        KeyCode::Char('/') | KeyCode::Char('i') => {
-            app.enter_search_mode();
-            false
-        }
-        KeyCode::Down | KeyCode::Char('j') => {
-            app.next();
-            false
-        }
-        KeyCode::Up | KeyCode::Char('k') => {
-            app.previous();
-            false
-        }
-        KeyCode::Enter => {
-            app.confirm_kill();
-            false
-        }
-        KeyCode::Esc => {
-            false
-        }
-        KeyCode::Char('r') => {
-            let _ = app.refresh_ports();
-            false
-        }
-        _ => false,
-    }
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn handle_search_mode(app: &mut App, key: KeyEvent) -> bool {
     match key.code {
         KeyCode::Esc => {
             app.exit_search_mode();
             false
         }

---- events::tests::test_search_mode_activation stdout ----

thread 'events::tests::test_search_mode_activation' (894778) panicked at src/events.rs:115:2:
assertion failed: matches!(app.mode, crate::app::Mode::Search)

---- events::tests::test_navigation stdout ----

thread 'events::tests::test_navigation' (894776) panicked at src/events.rs:99:9:
assertion `left == right` failed
  left: 0
 right: 1

---- events::tests::test_quit_with_q stdout ----

thread 'events::tests::test_quit_with_q' (894777) panicked at src/events.rs:88:2:
assertion failed: should_quit

failures:
    events::tests::test_navigation
    events::tests::test_quit_with_q
    events::tests::test_search_mode_activation

test result: FAILED. 12 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
