*** src/events.rs:27:9: delete match arm KeyCode::Char('q') | KeyCode::Char('Q') in handle_normal_mode

*** mutation diff:
--- src/events.rs
+++ delete match arm KeyCode::Char('q') | KeyCode::Char('Q') in handle_normal_mode
@@ -19,20 +19,17 @@
         Mode::Normal => handle_normal_mode(app, key),
         Mode::Search => handle_search_mode(app, key),
         Mode::ConfirmKill { .. } => handle_confirm_mode(app, key),
     }
 }
 
 fn handle_normal_mode(app: &mut App, key: KeyEvent) -> bool {
     match key.code {
-        KeyCode::Char('q') | KeyCode::Char('Q') => {
-            app.should_quit = true;
-            true
-        }
+         /* ~ changed by cargo-mutants ~ */
         KeyCode::Char('c') if key.modifiers.contains(KeyModifiers::CONTROL) => {
             app.should_quit = true;
             true
         }
         KeyCode::Char('/') | KeyCode::Char('i') => {
             app.enter_search_mode();
             false
         }

---- events::tests::test_quit_with_q stdout ----

thread 'events::tests::test_quit_with_q' (949595) panicked at src/events.rs:118:2:
assertion failed: should_quit

failures:
    events::tests::test_quit_with_q

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
