*** src/events.rs:31:31: replace match guard key.modifiers.contains(KeyModifiers::CONTROL) with false in handle_normal_mode

*** mutation diff:
--- src/events.rs
+++ replace match guard key.modifiers.contains(KeyModifiers::CONTROL) with false in handle_normal_mode
@@ -23,17 +23,17 @@
 }
 
 fn handle_normal_mode(app: &mut App, key: KeyEvent) -> bool {
     match key.code {
         KeyCode::Char('q') | KeyCode::Char('Q') => {
             app.should_quit = true;
             true
         }
-        KeyCode::Char('c') if key.modifiers.contains(KeyModifiers::CONTROL) => {
+        KeyCode::Char('c') if false /* ~ changed by cargo-mutants ~ */ => {
             app.should_quit = true;
             true
         }
         KeyCode::Char('/') | KeyCode::Char('i') => {
             app.enter_search_mode();
             false
         }
         KeyCode::Down | KeyCode::Char('j') => {

*** result: Success
