*** src/events.rs:35:9: delete match arm KeyCode::Char('/') | KeyCode::Char('i') in handle_normal_mode

*** mutation diff:
--- src/events.rs
+++ delete match arm KeyCode::Char('/') | KeyCode::Char('i') in handle_normal_mode
@@ -27,20 +27,17 @@
         KeyCode::Char('q') | KeyCode::Char('Q') => {
             app.should_quit = true;
             true
         }
         KeyCode::Char('c') if key.modifiers.contains(KeyModifiers::CONTROL) => {
             app.should_quit = true;
             true
         }
-        KeyCode::Char('/') | KeyCode::Char('i') => {
-            app.enter_search_mode();
-            false
-        }
+         /* ~ changed by cargo-mutants ~ */
         KeyCode::Down | KeyCode::Char('j') => {
             app.next();
             false
         }
         KeyCode::Up | KeyCode::Char('k') => {
             app.previous();
             false
         }

---- events::tests::test_search_mode_activation stdout ----

thread 'events::tests::test_search_mode_activation' (895623) panicked at src/events.rs:145:2:
assertion failed: matches!(app.mode, crate::app::Mode::Search)

failures:
    events::tests::test_search_mode_activation

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
