*** src/events.rs:39:9: delete match arm KeyCode::Down | KeyCode::Char('j') in handle_normal_mode

*** mutation diff:
--- src/events.rs
+++ delete match arm KeyCode::Down | KeyCode::Char('j') in handle_normal_mode
@@ -31,20 +31,17 @@
         KeyCode::Char('c') if key.modifiers.contains(KeyModifiers::CONTROL) => {
             app.should_quit = true;
             true
         }
         KeyCode::Char('/') | KeyCode::Char('i') => {
             app.enter_search_mode();
             false
         }
-        KeyCode::Down | KeyCode::Char('j') => {
-            app.next();
-            false
-        }
+         /* ~ changed by cargo-mutants ~ */
         KeyCode::Up | KeyCode::Char('k') => {
             app.previous();
             false
         }
         KeyCode::Enter => {
             app.confirm_kill();
             false
         }

---- events::tests::test_navigation stdout ----

thread 'events::tests::test_navigation' (950439) panicked at src/events.rs:129:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    events::tests::test_navigation

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
