*** src/events.rs:43:9: delete match arm KeyCode::Up | KeyCode::Char('k') in handle_normal_mode

*** mutation diff:
--- src/events.rs
+++ delete match arm KeyCode::Up | KeyCode::Char('k') in handle_normal_mode
@@ -35,20 +35,17 @@
         KeyCode::Char('/') | KeyCode::Char('i') => {
             app.enter_search_mode();
             false
         }
         KeyCode::Down | KeyCode::Char('j') => {
             app.next();
             false
         }
-        KeyCode::Up | KeyCode::Char('k') => {
-            app.previous();
-            false
-        }
+         /* ~ changed by cargo-mutants ~ */
         KeyCode::Enter => {
             app.confirm_kill();
             false
         }
         KeyCode::Esc => {
             false
         }
         KeyCode::Char('r') => {

---- events::tests::test_navigation stdout ----

thread 'events::tests::test_navigation' (896506) panicked at src/events.rs:135:9:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    events::tests::test_navigation

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
