*** src/events.rs:47:9: delete match arm KeyCode::Enter in handle_normal_mode

*** mutation diff:
--- src/events.rs
+++ delete match arm KeyCode::Enter in handle_normal_mode
@@ -39,20 +39,17 @@
         KeyCode::Down | KeyCode::Char('j') => {
             app.next();
             false
         }
         KeyCode::Up | KeyCode::Char('k') => {
             app.previous();
             false
         }
-        KeyCode::Enter => {
-            app.confirm_kill();
-            false
-        }
+         /* ~ changed by cargo-mutants ~ */
         KeyCode::Esc => {
             false
         }
         KeyCode::Char('r') => {
             let _ = app.refresh_ports();
             false
         }
         _ => false,

*** result: Success
