*** src/events.rs:51:9: delete match arm KeyCode::Esc in handle_normal_mode

*** mutation diff:
--- src/events.rs
+++ delete match arm KeyCode::Esc in handle_normal_mode
@@ -43,19 +43,17 @@
         KeyCode::Up | KeyCode::Char('k') => {
             app.previous();
             false
         }
         KeyCode::Enter => {
             app.confirm_kill();
             false
         }
-        KeyCode::Esc => {
-            false
-        }
+         /* ~ changed by cargo-mutants ~ */
         KeyCode::Char('r') => {
             let _ = app.refresh_ports();
             false
         }
         _ => false,
     }
 }

*** result: Success
