*** src/events.rs:54:9: delete match arm KeyCode::Char('r') in handle_normal_mode

*** mutation diff:
--- src/events.rs
+++ delete match arm KeyCode::Char('r') in handle_normal_mode
@@ -46,20 +46,17 @@
         }
         KeyCode::Enter => {
             app.confirm_kill();
             false
         }
         KeyCode::Esc => {
             false
         }
-        KeyCode::Char('r') => {
-            let _ = app.refresh_ports();
-            false
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => false,
     }
 }
 
 fn handle_search_mode(app: &mut App, key: KeyEvent) -> bool {
     match key.code {
         KeyCode::Esc => {
             app.exit_search_mode();

*** result: Success
