*** src/events.rs:63:5: replace handle_search_mode -> bool with true

*** mutation diff:
--- src/events.rs
+++ replace handle_search_mode -> bool with true
@@ -55,39 +55,17 @@
             let _ = app.refresh_ports();
             false
         }
         _ => false,
     }
 }
 
 fn handle_search_mode(app: &mut App, key: KeyEvent) -> bool {
-    match key.code {
-        KeyCode::Esc => {
-            app.exit_search_mode();
-            false
-        }
-        KeyCode::Enter => {
-            app.exit_search_mode();
-            false
-        }
-        KeyCode::Backspace => {
-            let mut query = app.search_query.clone();
-            query.pop();
-            app.update_search(query);
-            false
-        }
-        KeyCode::Char(c) => {
-            let mut query = app.search_query.clone();
-            query.push(c);
-            app.update_search(query);
-            false
-        }
-        _ => false,
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn handle_confirm_mode(app: &mut App, key: KeyEvent) -> bool {
     match key.code {
         KeyCode::Char('y') | KeyCode::Char('Y') => {
             app.execute_kill();
             false
         }

---- events::tests::test_search_typing stdout ----

thread 'events::tests::test_search_typing' (953547) panicked at src/events.rs:147:2:
assertion `left == right` failed
  left: ""
 right: "test"

---- events::tests::test_search_mode_exit stdout ----

thread 'events::tests::test_search_mode_exit' (953546) panicked at src/events.rs:134:2:
assertion failed: matches!(app.mode, crate::app::Mode::Normal)

failures:
    events::tests::test_search_mode_exit
    events::tests::test_search_typing

test result: FAILED. 13 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
