*** src/events.rs:64:9: delete match arm KeyCode::Esc in handle_search_mode

*** mutation diff:
--- src/events.rs
+++ delete match arm KeyCode::Esc in handle_search_mode
@@ -56,20 +56,17 @@
             false
         }
         _ => false,
     }
 }
 
 fn handle_search_mode(app: &mut App, key: KeyEvent) -> bool {
     match key.code {
-        KeyCode::Esc => {
-            app.exit_search_mode();
-            false
-        }
+         /* ~ changed by cargo-mutants ~ */
         KeyCode::Enter => {
             app.exit_search_mode();
             false
         }
         KeyCode::Backspace => {
             let mut query = app.search_query.clone();
             query.pop();
             app.update_search(query);

---- events::tests::test_search_mode_exit stdout ----

thread 'events::tests::test_search_mode_exit' (900038) panicked at src/events.rs:153:2:
assertion failed: matches!(app.mode, crate::app::Mode::Normal)

failures:
    events::tests::test_search_mode_exit

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
