*** src/events.rs:68:9: delete match arm KeyCode::Enter in handle_search_mode

*** mutation diff:
--- src/events.rs
+++ delete match arm KeyCode::Enter in handle_search_mode
@@ -60,20 +60,17 @@
 }
 
 fn handle_search_mode(app: &mut App, key: KeyEvent) -> bool {
     match key.code {
         KeyCode::Esc => {
             app.exit_search_mode();
             false
         }
-        KeyCode::Enter => {
-            app.exit_search_mode();
-            false
-        }
+         /* ~ changed by cargo-mutants ~ */
         KeyCode::Backspace => {
             let mut query = app.search_query.clone();
             query.pop();
             app.update_search(query);
             false
         }
         KeyCode::Char(c) => {
             let mut query = app.search_query.clone();

*** result: Success
