*** src/events.rs:72:9: delete match arm KeyCode::Backspace in handle_search_mode

*** mutation diff:
--- src/events.rs
+++ delete match arm KeyCode::Backspace in handle_search_mode
@@ -64,22 +64,17 @@
         KeyCode::Esc => {
             app.exit_search_mode();
             false
         }
         KeyCode::Enter => {
             app.exit_search_mode();
             false
         }
-        KeyCode::Backspace => {
-            let mut query = app.search_query.clone();
-            query.pop();
-            app.update_search(query);
-            false
-        }
+         /* ~ changed by cargo-mutants ~ */
         KeyCode::Char(c) => {
             let mut query = app.search_query.clone();
             query.push(c);
             app.update_search(query);
             false
         }
         _ => false,
     }

*** result: Success
