*** src/events.rs:78:9: delete match arm KeyCode::Char(c) in handle_search_mode

*** mutation diff:
--- src/events.rs
+++ delete match arm KeyCode::Char(c) in handle_search_mode
@@ -70,22 +70,17 @@
             false
         }
         KeyCode::Backspace => {
             let mut query = app.search_query.clone();
             query.pop();
             app.update_search(query);
             false
         }
-        KeyCode::Char(c) => {
-            let mut query = app.search_query.clone();
-            query.push(c);
-            app.update_search(query);
-            false
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => false,
     }
 }
 
 fn handle_confirm_mode(app: &mut App, key: KeyEvent) -> bool {
     match key.code {
         KeyCode::Char('y') | KeyCode::Char('Y') => {
             app.execute_kill();

---- events::tests::test_search_typing stdout ----

thread 'events::tests::test_search_typing' (955773) panicked at src/events.rs:164:2:
assertion `left == right` failed
  left: ""
 right: "test"

failures:
    events::tests::test_search_typing

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
