*** src/events.rs:7:5: replace handle -> io::Result<bool> with Ok(true)

*** mutation diff:
--- src/events.rs
+++ replace handle -> io::Result<bool> with Ok(true)
@@ -1,22 +1,15 @@
 use crossterm::event::{self, Event, KeyCode, KeyEvent, KeyEventKind, KeyModifiers};
 use std::io;
 
 use crate::app::{App, Mode};
 
 pub fn handle(app: &mut App) -> io::Result<bool> {
-    if event::poll(std::time::Duration::from_millis(100))? {
-        if let Event::Key(key) = event::read()? {
-            if key.kind == KeyEventKind::Press {
-                return Ok(handle_key_event(app, key));
-            }
-        }
-    }
-    Ok(false)
+    Ok(true) /* ~ changed by cargo-mutants ~ */
 }
 
 fn handle_key_event(app: &mut App, key: KeyEvent) -> bool {
     match &app.mode {
         Mode::Normal => handle_normal_mode(app, key),
         Mode::Search => handle_search_mode(app, key),
         Mode::ConfirmKill { .. } => handle_confirm_mode(app, key),
     }

*** result: Success
