*** src/events.rs:89:5: replace handle_confirm_mode -> bool with false

*** mutation diff:
--- src/events.rs
+++ replace handle_confirm_mode -> bool with false
@@ -81,27 +81,17 @@
             app.update_search(query);
             false
         }
         _ => false,
     }
 }
 
 fn handle_confirm_mode(app: &mut App, key: KeyEvent) -> bool {
-    match key.code {
-        KeyCode::Char('y') | KeyCode::Char('Y') => {
-            app.execute_kill();
-            false
-        }
-        KeyCode::Char('n') | KeyCode::Char('N') | KeyCode::Esc => {
-            app.cancel_modal();
-            false
-        }
-        _ => false,
-    }
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use crate::app::App;
     use crate::ports::PortInfo;
     use crate::events::{handle_normal_mode, handle_search_mode, handle_confirm_mode};
     use crossterm::event::KeyCode;

---- events::tests::test_confirm_mode_no stdout ----

thread 'events::tests::test_confirm_mode_no' (956611) panicked at src/events.rs:193:9:
assertion failed: matches!(app.mode, crate::app::Mode::Normal)

---- events::tests::test_confirm_mode_yes stdout ----

thread 'events::tests::test_confirm_mode_yes' (956612) panicked at src/events.rs:177:2:
assertion failed: matches!(app.mode, crate::app::Mode::Normal)

failures:
    events::tests::test_confirm_mode_no
    events::tests::test_confirm_mode_yes

test result: FAILED. 13 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
