*** src/events.rs:90:9: delete match arm KeyCode::Char('y') | KeyCode::Char('Y') in handle_confirm_mode

*** mutation diff:
--- src/events.rs
+++ delete match arm KeyCode::Char('y') | KeyCode::Char('Y') in handle_confirm_mode
@@ -82,20 +82,17 @@
             false
         }
         _ => false,
     }
 }
 
 fn handle_confirm_mode(app: &mut App, key: KeyEvent) -> bool {
     match key.code {
-        KeyCode::Char('y') | KeyCode::Char('Y') => {
-            app.execute_kill();
-            false
-        }
+         /* ~ changed by cargo-mutants ~ */
         KeyCode::Char('n') | KeyCode::Char('N') | KeyCode::Esc => {
             app.cancel_modal();
             false
         }
         _ => false,
     }
 }

---- events::tests::test_confirm_mode_yes stdout ----

thread 'events::tests::test_confirm_mode_yes' (902625) panicked at src/events.rs:184:2:
assertion failed: matches!(app.mode, crate::app::Mode::Normal)

failures:
    events::tests::test_confirm_mode_yes

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
