*** src/events.rs:94:9: delete match arm KeyCode::Char('n') | KeyCode::Char('N') | KeyCode::Esc in handle_confirm_mode

*** mutation diff:
--- src/events.rs
+++ delete match arm KeyCode::Char('n') | KeyCode::Char('N') | KeyCode::Esc in handle_confirm_mode
@@ -86,20 +86,17 @@
 }
 
 fn handle_confirm_mode(app: &mut App, key: KeyEvent) -> bool {
     match key.code {
         KeyCode::Char('y') | KeyCode::Char('Y') => {
             app.execute_kill();
             false
         }
-        KeyCode::Char('n') | KeyCode::Char('N') | KeyCode::Esc => {
-            app.cancel_modal();
-            false
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => false,
     }
 }
 
 #[cfg(test)]
 mod tests {
     use crate::app::App;
     use crate::ports::PortInfo;

---- events::tests::test_confirm_mode_no stdout ----

thread 'events::tests::test_confirm_mode_no' (957457) panicked at src/events.rs:200:9:
assertion failed: matches!(app.mode, crate::app::Mode::Normal)

failures:
    events::tests::test_confirm_mode_no

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
