*** src/filter.rs:15:5: replace is_blocked_port -> bool with true

*** mutation diff:
--- src/filter.rs
+++ replace is_blocked_port -> bool with true
@@ -7,17 +7,17 @@
     "sshd",
     "tor",
     "docker",
     "kubelet",
     "kube-proxy",
 ];
 
 pub fn is_blocked_port(port: u16) -> bool {
-    BLOCKED_PORTS.contains(&port)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn is_blocked_process(name: &str) -> bool {
     let name_lower = name.to_lowercase();
     BLOCKED_PROCESSES.iter().any(|blocked| name_lower.contains(blocked))
 }
 
 pub fn should_include_port(port: u16, process_name: &str) -> bool {

---- filter::tests::test_blocked_ports stdout ----

thread 'filter::tests::test_blocked_ports' (903508) panicked at src/filter.rs:36:9:
assertion failed: !is_blocked_port(9999)

---- filter::tests::test_should_include_port stdout ----

thread 'filter::tests::test_should_include_port' (903510) panicked at src/filter.rs:55:9:
assertion failed: should_include_port(9999, "firefox")

failures:
    filter::tests::test_blocked_ports
    filter::tests::test_should_include_port

test result: FAILED. 13 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
