*** src/filter.rs:19:5: replace is_blocked_process -> bool with true

*** mutation diff:
--- src/filter.rs
+++ replace is_blocked_process -> bool with true
@@ -11,18 +11,17 @@
     "kube-proxy",
 ];
 
 pub fn is_blocked_port(port: u16) -> bool {
     BLOCKED_PORTS.contains(&port)
 }
 
 pub fn is_blocked_process(name: &str) -> bool {
-    let name_lower = name.to_lowercase();
-    BLOCKED_PROCESSES.iter().any(|blocked| name_lower.contains(blocked))
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn should_include_port(port: u16, process_name: &str) -> bool {
     !is_blocked_port(port) && !is_blocked_process(process_name)
 }
 
 #[cfg(test)]
 mod tests {

---- filter::tests::test_blocked_processes stdout ----

thread 'filter::tests::test_blocked_processes' (958755) panicked at src/filter.rs:45:9:
assertion failed: !is_blocked_process("firefox")

---- filter::tests::test_should_include_port stdout ----

thread 'filter::tests::test_should_include_port' (958756) panicked at src/filter.rs:54:9:
assertion failed: should_include_port(9999, "firefox")

failures:
    filter::tests::test_blocked_processes
    filter::tests::test_should_include_port

test result: FAILED. 13 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
