*** src/filter.rs:24:28: replace && with || in should_include_port

*** mutation diff:
--- src/filter.rs
+++ replace && with || in should_include_port
@@ -16,17 +16,17 @@
 }
 
 pub fn is_blocked_process(name: &str) -> bool {
     let name_lower = name.to_lowercase();
     BLOCKED_PROCESSES.iter().any(|blocked| name_lower.contains(blocked))
 }
 
 pub fn should_include_port(port: u16, process_name: &str) -> bool {
-    !is_blocked_port(port) && !is_blocked_process(process_name)
+    !is_blocked_port(port) || /* ~ changed by cargo-mutants ~ */ !is_blocked_process(process_name)
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn test_blocked_ports() {

---- filter::tests::test_should_include_port stdout ----

thread 'filter::tests::test_should_include_port' (906032) panicked at src/filter.rs:52:9:
assertion failed: !should_include_port(22, "firefox")

failures:
    filter::tests::test_should_include_port

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
