*** src/filter.rs:24:5: replace should_include_port -> bool with false

*** mutation diff:
--- src/filter.rs
+++ replace should_include_port -> bool with false
@@ -16,17 +16,17 @@
 }
 
 pub fn is_blocked_process(name: &str) -> bool {
     let name_lower = name.to_lowercase();
     BLOCKED_PROCESSES.iter().any(|blocked| name_lower.contains(blocked))
 }
 
 pub fn should_include_port(port: u16, process_name: &str) -> bool {
-    !is_blocked_port(port) && !is_blocked_process(process_name)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn test_blocked_ports() {

---- filter::tests::test_should_include_port stdout ----

thread 'filter::tests::test_should_include_port' (905610) panicked at src/filter.rs:55:9:
assertion failed: should_include_port(9999, "firefox")

failures:
    filter::tests::test_should_include_port

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
