*** src/main.rs:65:2: replace kill_by_port -> io::Result<()> with Ok(())

*** mutation diff:
--- src/main.rs
+++ replace kill_by_port -> io::Result<()> with Ok(())
@@ -57,14 +57,10 @@
  }
 
  terminal::disable_raw_mode()?;
  io::stdout().execute(LeaveAlternateScreen)?;
  Ok(ExitCode::SUCCESS)
 }
 
 fn kill_by_port(port: u16) -> io::Result<()> {
- let all_ports = get_open_ports()?;
- if let Some(port_info) = all_ports.iter().find(|p| p.port == port) {
- return process::kill_process(port_info.pid);
- }
- Err(io::Error::new(io::ErrorKind::NotFound, format!("No process found on port {}", port)))
+ Ok(()) /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
