*** src/main.rs:66:60: replace == with != in kill_by_port

*** mutation diff:
--- src/main.rs
+++ replace == with != in kill_by_port
@@ -58,13 +58,13 @@
 
  terminal::disable_raw_mode()?;
  io::stdout().execute(LeaveAlternateScreen)?;
  Ok(ExitCode::SUCCESS)
 }
 
 fn kill_by_port(port: u16) -> io::Result<()> {
  let all_ports = get_open_ports()?;
- if let Some(port_info) = all_ports.iter().find(|p| p.port == port) {
+ if let Some(port_info) = all_ports.iter().find(|p| p.port != /* ~ changed by cargo-mutants ~ */ port) {
  return process::kill_process(port_info.pid);
  }
  Err(io::Error::new(io::ErrorKind::NotFound, format!("No process found on port {}", port)))
 }

*** result: Success
