*** src/ports.rs:105:5: replace parse_port -> u16 with 0

*** mutation diff:
--- src/ports.rs
+++ replace parse_port -> u16 with 0
@@ -97,23 +97,17 @@
             });
         }
     }
 
     Ok(())
 }
 
 fn parse_port(hex_addr: &str) -> u16 {
-    if let Some(colon_pos) = hex_addr.rfind(':') {
-        let port_hex = &hex_addr[colon_pos + 1..];
-        if let Ok(port) = u16::from_str_radix(port_hex, 16) {
-            return port;
-        }
-    }
-    0
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn get_process_info(pid: u32) -> (String, String) {
     let exe_link = format!("/proc/{}/exe", pid);
     let cmdline_path = format!("/proc/{}/comm", pid);
 
     let path = fs::read_link(&exe_link)
         .map(|p| p.to_string_lossy().to_string())

---- ports::tests::test_parse_port stdout ----

thread 'ports::tests::test_parse_port' (967007) panicked at src/ports.rs:129:9:
assertion `left == right` failed
  left: 0
 right: 8080

failures:
    ports::tests::test_parse_port

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
