*** src/ports.rs:106:44: replace + with * in parse_port

*** mutation diff:
--- src/ports.rs
+++ replace + with * in parse_port
@@ -98,17 +98,17 @@
         }
     }
 
     Ok(())
 }
 
 fn parse_port(hex_addr: &str) -> u16 {
     if let Some(colon_pos) = hex_addr.rfind(':') {
-        let port_hex = &hex_addr[colon_pos + 1..];
+        let port_hex = &hex_addr[colon_pos * /* ~ changed by cargo-mutants ~ */ 1..];
         if let Ok(port) = u16::from_str_radix(port_hex, 16) {
             return port;
         }
     }
     0
 }
 
 fn get_process_info(pid: u32) -> (String, String) {

---- ports::tests::test_parse_port stdout ----

thread 'ports::tests::test_parse_port' (913871) panicked at src/ports.rs:135:9:
assertion `left == right` failed
  left: 0
 right: 8080

failures:
    ports::tests::test_parse_port

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
