*** src/ports.rs:59:5: replace parse_tcp_file -> io::Result<()> with Ok(())

*** mutation diff:
--- src/ports.rs
+++ replace parse_tcp_file -> io::Result<()> with Ok(())
@@ -51,59 +51,17 @@
 }
 
 fn parse_tcp_file(
     path: &str,
     ports: &mut Vec<PortInfo>,
     inode_pid_map: &mut HashMap<u64, u32>,
     _is_ipv6: bool,
 ) -> io::Result<()> {
-    let file = fs::File::open(path)?;
-    let reader = BufReader::new(file);
-
-    for line in reader.lines().skip(1) {
-        let line = line?;
-        let parts: Vec<&str> = line.split_whitespace().collect();
-        if parts.len() < 10 {
-            continue;
-        }
-
-        let _local_addr = parts[1];
-        let _rem_addr = parts[2];
-        let state = parts[3];
-        let inode_str = parts[9];
-
-        if state != "0A" {
-            continue;
-        }
-
-        let port = parse_port(_local_addr);
-
-        let inode: u64 = match inode_str.parse() {
-            Ok(n) => n,
-            Err(_) => continue,
-        };
-
-        if inode == 0 {
-            continue;
-        }
-
-        if let Some(&pid) = inode_pid_map.get(&inode) {
-            let (name, path) = get_process_info(pid);
-
-            ports.push(PortInfo {
-                port,
-                pid,
-                process_name: name,
-                process_path: path,
-            });
-        }
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_port(hex_addr: &str) -> u16 {
     if let Some(colon_pos) = hex_addr.rfind(':') {
         let port_hex = &hex_addr[colon_pos + 1..];
         if let Ok(port) = u16::from_str_radix(port_hex, 16) {
             return port;
         }

*** result: Success
