*** src/ports.rs:85:18: replace == with != in parse_tcp_file

*** mutation diff:
--- src/ports.rs
+++ replace == with != in parse_tcp_file
@@ -77,17 +77,17 @@
 
         let port = parse_port(_local_addr);
 
         let inode: u64 = match inode_str.parse() {
             Ok(n) => n,
             Err(_) => continue,
         };
 
-        if inode == 0 {
+        if inode != /* ~ changed by cargo-mutants ~ */ 0 {
             continue;
         }
 
         if let Some(&pid) = inode_pid_map.get(&inode) {
             let (name, path) = get_process_info(pid);
 
             ports.push(PortInfo {
                 port,

*** result: Success
