*** src/process.rs:13:25: replace == with != in format_error

*** mutation diff:
--- src/process.rs
+++ replace == with != in format_error
@@ -5,17 +5,17 @@
     if result == 0 {
         Ok(())
     } else {
         Err(io::Error::last_os_error())
     }
 }
 
 pub fn format_error(e: &io::Error) -> String {
-    if e.raw_os_error() == Some(libc::ESRCH) {
+    if e.raw_os_error() != /* ~ changed by cargo-mutants ~ */ Some(libc::ESRCH) {
         "Process not found (may have already exited)".to_string()
     } else if e.raw_os_error() == Some(libc::EPERM) {
         "Permission denied".to_string()
     } else {
         e.to_string()
     }
 }

*** result: Success
