*** src/process.rs:13:5: replace format_error -> String with String::new()

*** mutation diff:
--- src/process.rs
+++ replace format_error -> String with String::new()
@@ -5,23 +5,17 @@
     if result == 0 {
         Ok(())
     } else {
         Err(io::Error::last_os_error())
     }
 }
 
 pub fn format_error(e: &io::Error) -> String {
-    if e.raw_os_error() == Some(libc::ESRCH) {
-        "Process not found (may have already exited)".to_string()
-    } else if e.raw_os_error() == Some(libc::EPERM) {
-        "Permission denied".to_string()
-    } else {
-        e.to_string()
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn test_kill_nonexistent_process() {

---- process::tests::test_kill_nonexistent_process stdout ----

thread 'process::tests::test_kill_nonexistent_process' (916964) panicked at src/process.rs:27:13:
assertion failed: formatted.contains("not found") || formatted.contains("No such process")

failures:
    process::tests::test_kill_nonexistent_process

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
