*** src/process.rs:4:5: replace kill_process -> io::Result<()> with Ok(())

*** mutation diff:
--- src/process.rs
+++ replace kill_process -> io::Result<()> with Ok(())
@@ -1,17 +1,12 @@
 use std::io;
 
 pub fn kill_process(pid: u32) -> io::Result<()> {
-    let result = unsafe { libc::kill(pid as libc::pid_t, libc::SIGKILL) };
-    if result == 0 {
-        Ok(())
-    } else {
-        Err(io::Error::last_os_error())
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn format_error(e: &io::Error) -> String {
     if e.raw_os_error() == Some(libc::ESRCH) {
         "Process not found (may have already exited)".to_string()
     } else if e.raw_os_error() == Some(libc::EPERM) {
         "Permission denied".to_string()
     } else {

---- process::tests::test_kill_nonexistent_process stdout ----

thread 'process::tests::test_kill_nonexistent_process' (916081) panicked at src/process.rs:24:9:
assertion failed: result.is_err()

failures:
    process::tests::test_kill_nonexistent_process

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
