*** src/process.rs:5:15: replace == with != in kill_process

*** mutation diff:
--- src/process.rs
+++ replace == with != in kill_process
@@ -1,13 +1,13 @@
 use std::io;
 
 pub fn kill_process(pid: u32) -> io::Result<()> {
     let result = unsafe { libc::kill(pid as libc::pid_t, libc::SIGKILL) };
-    if result == 0 {
+    if result != /* ~ changed by cargo-mutants ~ */ 0 {
         Ok(())
     } else {
         Err(io::Error::last_os_error())
     }
 }
 
 pub fn format_error(e: &io::Error) -> String {
     if e.raw_os_error() == Some(libc::ESRCH) {

---- process::tests::test_kill_nonexistent_process stdout ----

thread 'process::tests::test_kill_nonexistent_process' (970946) panicked at src/process.rs:29:9:
assertion failed: result.is_err()

failures:
    process::tests::test_kill_nonexistent_process

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
