*** src/ui.rs:109:8: delete ! in render_table

*** mutation diff:
--- src/ui.rs
+++ delete ! in render_table
@@ -101,17 +101,17 @@
                 "Open Ports (showing {} of {})",
                 app.filtered.len(),
                 app.ports.len()
             )),
     );
 
     frame.render_widget(table, area);
 
-    if !app.filtered.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */app.filtered.is_empty() {
         if let Mode::Normal = app.mode {
             let highlight_idx = app.selected;
             let first_visible = 0usize;
             let visible_count = area.height.saturating_sub(3) as usize;
 
             let offset = if highlight_idx < first_visible + visible_count / 2 {
                 0
             } else {

*** result: Success
