*** src/ui.rs:118:60: replace / with * in render_table

*** mutation diff:
--- src/ui.rs
+++ replace / with * in render_table
@@ -110,17 +110,17 @@
         if let Mode::Normal = app.mode {
             let highlight_idx = app.selected;
             let first_visible = 0usize;
             let visible_count = area.height.saturating_sub(3) as usize;
 
             let offset = if highlight_idx < first_visible + visible_count / 2 {
                 0
             } else {
-                highlight_idx.saturating_sub(visible_count / 2)
+                highlight_idx.saturating_sub(visible_count * /* ~ changed by cargo-mutants ~ */ 2)
             };
 
             let _ = offset;
         }
     }
 
     if let Some(msg) = &app.message {
         let area = centered_rect(60, 20, frame.area());

*** result: Success
