*** src/ui.rs:155:5: replace render_confirm_modal with ()

*** mutation diff:
--- src/ui.rs
+++ replace render_confirm_modal with ()
@@ -147,45 +147,17 @@
     let footer = Paragraph::new(hints)
         .style(Style::default().fg(Color::Gray))
         .alignment(Alignment::Center);
 
     frame.render_widget(footer, area);
 }
 
 fn render_confirm_modal(frame: &mut Frame, pid: &u32, name: &str) {
-    let area = centered_rect(50, 20, frame.area());
-    let block = Block::default()
-        .borders(Borders::ALL)
-        .border_style(Style::default().fg(Color::Red))
-        .title("Confirm Kill")
-        .title_alignment(Alignment::Center);
-
-    let text = Text::from(vec![
-        Line::from(Span::styled(
-            format!("Kill process '{}'?", name),
-            Style::default().fg(Color::Yellow),
-        )),
-        Line::from(Span::styled(
-            format!("PID: {}", pid),
-            Style::default().fg(Color::White),
-        )),
-        Line::from(""),
-        Line::from(Span::styled(
-            "[Y]es  [N]o",
-            Style::default().add_modifier(Modifier::BOLD),
-        )),
-    ]);
-
-    let paragraph = Paragraph::new(text)
-        .block(block)
-        .alignment(Alignment::Center);
-
-    frame.render_widget(Clear, area);
-    frame.render_widget(paragraph, area);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn centered_rect(percent_x: u16, percent_y: u16, r: Rect) -> Rect {
     let popup_layout = Layout::default()
         .direction(Direction::Vertical)
         .constraints([
             Constraint::Percentage((100 - percent_y) / 2),
             Constraint::Percentage(percent_y),

*** result: Success
