*** src/ui.rs:190:41: replace - with / in centered_rect

*** mutation diff:
--- src/ui.rs
+++ replace - with / in centered_rect
@@ -182,17 +182,17 @@
     frame.render_widget(Clear, area);
     frame.render_widget(paragraph, area);
 }
 
 fn centered_rect(percent_x: u16, percent_y: u16, r: Rect) -> Rect {
     let popup_layout = Layout::default()
         .direction(Direction::Vertical)
         .constraints([
-            Constraint::Percentage((100 - percent_y) / 2),
+            Constraint::Percentage((100 / /* ~ changed by cargo-mutants ~ */ percent_y) / 2),
             Constraint::Percentage(percent_y),
             Constraint::Percentage((100 - percent_y) / 2),
         ])
         .split(r);
 
     Layout::default()
         .direction(Direction::Horizontal)
         .constraints([

*** result: Success
