*** src/ui.rs:192:54: replace / with * in centered_rect

*** mutation diff:
--- src/ui.rs
+++ replace / with * in centered_rect
@@ -184,17 +184,17 @@
 }
 
 fn centered_rect(percent_x: u16, percent_y: u16, r: Rect) -> Rect {
     let popup_layout = Layout::default()
         .direction(Direction::Vertical)
         .constraints([
             Constraint::Percentage((100 - percent_y) / 2),
             Constraint::Percentage(percent_y),
-            Constraint::Percentage((100 - percent_y) / 2),
+            Constraint::Percentage((100 - percent_y) * /* ~ changed by cargo-mutants ~ */ 2),
         ])
         .split(r);
 
     Layout::default()
         .direction(Direction::Horizontal)
         .constraints([
             Constraint::Percentage((100 - percent_x) / 2),
             Constraint::Percentage(percent_x),

*** result: Success
