*** src/ui.rs:199:54: replace / with * in centered_rect

*** mutation diff:
--- src/ui.rs
+++ replace / with * in centered_rect
@@ -191,17 +191,17 @@
             Constraint::Percentage(percent_y),
             Constraint::Percentage((100 - percent_y) / 2),
         ])
         .split(r);
 
     Layout::default()
         .direction(Direction::Horizontal)
         .constraints([
-            Constraint::Percentage((100 - percent_x) / 2),
+            Constraint::Percentage((100 - percent_x) * /* ~ changed by cargo-mutants ~ */ 2),
             Constraint::Percentage(percent_x),
             Constraint::Percentage((100 - percent_x) / 2),
         ])
         .split(popup_layout[1])[1]
 }
 
 fn truncate(s: &str, max_len: usize) -> String {
     if s.len() <= max_len {

*** result: Success
