*** src/ui.rs:201:41: replace - with + in centered_rect

*** mutation diff:
--- src/ui.rs
+++ replace - with + in centered_rect
@@ -193,17 +193,17 @@
         ])
         .split(r);
 
     Layout::default()
         .direction(Direction::Horizontal)
         .constraints([
             Constraint::Percentage((100 - percent_x) / 2),
             Constraint::Percentage(percent_x),
-            Constraint::Percentage((100 - percent_x) / 2),
+            Constraint::Percentage((100 + /* ~ changed by cargo-mutants ~ */ percent_x) / 2),
         ])
         .split(popup_layout[1])[1]
 }
 
 fn truncate(s: &str, max_len: usize) -> String {
     if s.len() <= max_len {
         s.to_string()
     } else {

*** result: Success
