*** src/ui.rs:207:16: replace <= with > in truncate

*** mutation diff:
--- src/ui.rs
+++ replace <= with > in truncate
@@ -199,14 +199,14 @@
             Constraint::Percentage((100 - percent_x) / 2),
             Constraint::Percentage(percent_x),
             Constraint::Percentage((100 - percent_x) / 2),
         ])
         .split(popup_layout[1])[1]
 }
 
 fn truncate(s: &str, max_len: usize) -> String {
-    if s.len() <= max_len {
+    if s.len() > /* ~ changed by cargo-mutants ~ */ max_len {
         s.to_string()
     } else {
         format!("{}...", &s[..max_len.saturating_sub(3)])
     }
 }

*** result: Success
