*** src/ui.rs:207:5: replace truncate -> String with String::new()

*** mutation diff:
--- src/ui.rs
+++ replace truncate -> String with String::new()
@@ -199,14 +199,10 @@
             Constraint::Percentage((100 - percent_x) / 2),
             Constraint::Percentage(percent_x),
             Constraint::Percentage((100 - percent_x) / 2),
         ])
         .split(popup_layout[1])[1]
 }
 
 fn truncate(s: &str, max_len: usize) -> String {
-    if s.len() <= max_len {
-        s.to_string()
-    } else {
-        format!("{}...", &s[..max_len.saturating_sub(3)])
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
