*** src/ui.rs:32:5: replace render_header with ()

*** mutation diff:
--- src/ui.rs
+++ replace render_header with ()
@@ -24,39 +24,17 @@
     render_footer(frame, app, chunks[2]);
 
     if let Mode::ConfirmKill { pid, name } = &app.mode {
         render_confirm_modal(frame, pid, name);
     }
 }
 
 fn render_header(frame: &mut Frame, app: &App, area: Rect) {
-    let search_text = if matches!(app.mode, Mode::Search) {
-        format!("Search: {}", app.search_query)
-    } else if !app.search_query.is_empty() {
-        format!("Search: {} (press / to edit)", app.search_query)
-    } else {
-        "Press / to search".to_string()
-    };
-
-    let header = Paragraph::new(search_text)
-        .block(
-            Block::default()
-                .borders(Borders::ALL)
-                .border_style(Style::default().fg(Color::Cyan))
-                .title("Port Manager")
-                .title_alignment(Alignment::Center),
-        )
-        .style(if matches!(app.mode, Mode::Search) {
-            Style::default().fg(Color::Yellow)
-        } else {
-            Style::default()
-        });
-
-    frame.render_widget(header, area);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn render_table(frame: &mut Frame, app: &App, area: Rect) {
     let header = Row::new(vec!["PORT", "PID", "NAME", "PATH"])
         .style(
             Style::default()
                 .fg(Color::Cyan)
                 .add_modifier(Modifier::BOLD),

*** result: Success
