*** src/ui.rs:34:15: delete ! in render_header

*** mutation diff:
--- src/ui.rs
+++ delete ! in render_header
@@ -26,17 +26,17 @@
     if let Mode::ConfirmKill { pid, name } = &app.mode {
         render_confirm_modal(frame, pid, name);
     }
 }
 
 fn render_header(frame: &mut Frame, app: &App, area: Rect) {
     let search_text = if matches!(app.mode, Mode::Search) {
         format!("Search: {}", app.search_query)
-    } else if !app.search_query.is_empty() {
+    } else if  /* ~ changed by cargo-mutants ~ */app.search_query.is_empty() {
         format!("Search: {} (press / to edit)", app.search_query)
     } else {
         "Press / to search".to_string()
     };
 
     let header = Paragraph::new(search_text)
         .block(
             Block::default()

*** result: Success
