*** src/ui.rs:58:5: replace render_table with ()

*** mutation diff:
--- src/ui.rs
+++ replace render_table with ()
@@ -50,96 +50,17 @@
         } else {
             Style::default()
         });
 
     frame.render_widget(header, area);
 }
 
 fn render_table(frame: &mut Frame, app: &App, area: Rect) {
-    let header = Row::new(vec!["PORT", "PID", "NAME", "PATH"])
-        .style(
-            Style::default()
-                .fg(Color::Cyan)
-                .add_modifier(Modifier::BOLD),
-        );
-
-    let rows: Vec<Row> = app
-        .filtered
-        .iter()
-        .enumerate()
-        .map(|(idx, &port_idx)| {
-            let port = &app.ports[port_idx];
-            let is_selected = app.selected == idx;
-            let style = if is_selected {
-                Style::default()
-                    .bg(Color::DarkGray)
-                    .fg(Color::Cyan)
-                    .add_modifier(Modifier::BOLD)
-            } else {
-                Style::default()
-            };
-            Row::new(vec![
-                port.port.to_string(),
-                port.pid.to_string(),
-                truncate(&port.process_name, 15),
-                truncate(&port.process_path, 35),
-            ])
-            .style(style)
-        })
-        .collect();
-
-    let table = Table::new(rows, [
-        Constraint::Length(8),
-        Constraint::Length(8),
-        Constraint::Min(15),
-        Constraint::Min(35),
-    ])
-    .header(header)
-    .block(
-        Block::default()
-            .borders(Borders::ALL)
-            .title(format!(
-                "Open Ports (showing {} of {})",
-                app.filtered.len(),
-                app.ports.len()
-            )),
-    );
-
-    frame.render_widget(table, area);
-
-    if !app.filtered.is_empty() {
-        if let Mode::Normal = app.mode {
-            let highlight_idx = app.selected;
-            let first_visible = 0usize;
-            let visible_count = area.height.saturating_sub(3) as usize;
-
-            let offset = if highlight_idx < first_visible + visible_count / 2 {
-                0
-            } else {
-                highlight_idx.saturating_sub(visible_count / 2)
-            };
-
-            let _ = offset;
-        }
-    }
-
-    if let Some(msg) = &app.message {
-        let area = centered_rect(60, 20, frame.area());
-        let popup = Paragraph::new(msg.as_str())
-            .block(
-                Block::default()
-                    .borders(Borders::ALL)
-                    .border_style(Style::default().fg(Color::Yellow)),
-            )
-            .alignment(Alignment::Center)
-            .wrap(Wrap { trim: true });
-        frame.render_widget(Clear, area);
-        frame.render_widget(popup, area);
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn render_footer(frame: &mut Frame, app: &App, area: Rect) {
     let hints = match app.mode {
         Mode::Normal => "q:quit /:search j/k:navigate Enter:kill r:refresh",
         Mode::Search => "Esc:cancel Enter:done",
         Mode::ConfirmKill { .. } => "y:confirm n:cancel",
     };

*** result: Success
